raceCar/tem_raceCar/all/0.komega/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "flowState"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uinlet;

boundaryField
{

    "(Outlet|Inlet|Top)"
    {
        type            freestreamVelocity;
        freestreamValue $internalField;
    }

    Bottom
    {
        type            slip;
    }

    "Airfoil.*"
    {
        type            noSlip;
    }

    oversetPatch
    {
        type            overset;
    }
    "(Front|Back)" //frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
