raceCar/tem_raceCar/all/0.komega/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "flowState"
dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omega;

boundaryField
{
    "(Inlet|Outlet|Top)"
    {
        type            freestream; //zeroGradient;
        freestreamValue $internalField;
	value		$internalField;
    }

    "(Airfoil_f)"
    {
        type            omegaWallFunction;
        value           uniform $omega_wallf;
    }
    "(Airfoil_b)"
    {
        type            omegaWallFunction;
        value           uniform $omega_wallb;
    }
    Bottom
    {
        type            zeroGradient;
    }

    "(Front|Back)"
    {
        type            empty;
    }

    oversetPatch
    {
        type            overset;
    }
}
