raceCar/tem_raceCar/all/system/pWall_b
type            surfaceFieldValue;
libs            ("libfieldFunctionObjects.so");

writeControl    writeTime;
writeFields     true;

surfaceFormat   raw;
regionType      patch;
name            Airfoil_b;

operation       none;

fields
(
    p
    U
    //Ma
    yPlus
    //wallShearStress
);
