raceCar/tem_raceCar/all/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  regionToCell;
        insidePoints ((3.501 0.0 0.889));
    }

    {
        name    zone0;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
                sourceInfo
                {
                   set  c0;
                }
        
    }

/* 
    {
        name    zone1;
        type    cellSet;
        action  new;
        source  regionToCell;
        insidePoints ((1.501 0.0 0.001));
    }*/
);
